const 电价代码 =
    `36001001	居民电价(一户多人口)	居民生活	不满1千伏
36001002	居民合表电价(一户多人口)	居民生活	不满1千伏
31006001	大工业220千伏及以上	大工业用电	220千伏及以上
31006003	大工业220千伏及以上（发电厂用网电价）	大工业用电	220千伏及以上
31006005	大工业220千伏及以上（电动汽车）	大工业用电	220千伏及以上
31006011	大工业蓄冷电价(220千伏及以上)	大工业用电	220千伏及以上
32001001	普通工业不满1千伏	普通工业	不满1千伏
32001002	非工业1千伏以下	非工业	不满1千伏
32001003	农村饮水工程	农业生产	10千伏
32001004	普通工业不满1千伏（污水处理）	普通工业	不满1千伏
32001006	中小化肥普通工业不满1千伏	普通工业	不满1千伏
32001008	普通工业不满1千伏（电动汽车）	普通工业	不满1千伏
32001017	非工业蓄冷电价(不满1千伏)	非工业	不满1千伏
32001019	普通工业蓄冷电价(不满1千伏)	普通工业	不满1千伏
32002001	普通工业1-10千伏	普通工业	10千伏
32002002	非工业1-10千伏	非工业	10千伏
32002003	普通工业1－10千伏（污水处理）	普通工业	10千伏
32002005	中小化肥普通工业1-10千伏	普通工业	10千伏
32002008	普通工业1-10千伏（电动汽车）	普通工业	1-10千伏
32002013	普通工业蓄冷电价(1－10千伏)（弃用）	普通工业	10千伏
32002014	非工业蓄冷电价(1－10千伏)	非工业	10千伏
32002099	普通工业1-10千伏（港口岸电、污水处理、海水淡化）	普通工业	1-10千伏
32002101	广佛地铁	普通工业	35-110千伏
32003201	普通工业35千伏及以上	普通工业	35-110千伏
32003202	非工业35千伏及以上	非工业	35-110千伏
32003205	非工业蓄冷电价(35千伏及以上)	非工业	35-110千伏
32004001	甘竹滩洪潮发电站（小水电电价）	普通工业	110千伏
32004002	高明发电站（小水电电价）	普通工业	110千伏
33001001	商业1千伏以下	商业	不满1千伏
33001002	商业(平价商店)1千伏以下	商业	不满1千伏
33001003	农产品不满1千伏	商业	不满1千伏
33002001	商业1-10千伏	商业	10千伏
33002002	商业(平价商店)1-10千伏	商业	10千伏
33002003	农产品1-10千伏	商业	10千伏
33003202	农产品35千伏及以上	商业	35-110千伏
33003401	商业35千伏	商业	35千伏
33003403	商业蓄冷电价(1－10千伏)	商业	10千伏
33003404	商业蓄冷电价(35千伏及以上)	商业	35-110千伏
33003405	商业蓄冷电价(不满1千伏)	商业	不满1千伏
35001001	居民电价	居民生活	不满1千伏
35001002	居民合表电价	居民生活	不满1千伏
35001004	教学用电不满1千伏	非居民	不满1千伏
35002001	教学用电1-10千伏	非居民	10千伏
35002002	住宅用电1-10千伏	居民生活	10千伏
37001001	农业生产1千伏以下	农业生产	不满1千伏
37002001	农业生产1-10千伏	农业生产	10千伏
38001001	稻田排灌1千伏以下	农业排灌	不满1千伏
38002001	稻田排灌1-10千伏	农业排灌	10千伏
39002101	光伏发电电价	其它用电	10千伏
39004001	高明发电站（小水电电价新）	普通工业	110千伏
32603299	非工业35千伏及以上（通信基站分时）	非工业	35-110千伏
31003106	大工业35-110千伏及以上（电动汽车）	大工业用电	35-110千伏
31003119	大工业蓄冷电价(35-110千伏)	大工业用电	35-110千伏
31002099	大工业1-10千伏（港口岸电、污水处理、海水淡化）	大工业用电	1-10千伏
31003101	大工业35-110千伏	大工业用电	35-110千伏
31003102	大工业35-110千伏（限制类水泥企业差别电价）	大工业用电	35-110千伏
31003104	大工业35-110千伏（发电厂用网电价）	大工业用电	35-110千伏
32101004	大工业蓄冷电价(1-10千伏)	大工业用电	1-10千伏
32201004	普通工业蓄冷电价(1－10千伏)	普通工业	10千伏
00000000	无电价	其它用电	不满1千伏
31001001	氯碱行业生产用电	大工业用电	1-10千伏
32601099	非工业不满1千伏（通信基站分时）	非工业	不满1千伏
32602099	非工业1-10千伏（通信基站分时）	非工业	1-10千伏
32602299	非工业20千伏（通信基站分时）	非工业	20千伏
31001002	农村饮水工程(大工业)	农业生产	1-10千伏
31002001	大工业1-10千伏	大工业用电	1-10千伏
31002008	中小化肥大工业1-10千伏	大工业用电	1-10千伏
31002010	大工业1-10千伏（污水处理电价）	大工业用电	1-10千伏
31002012	大工业1-10千伏（发电厂用网电价）	大工业用电	1-10千伏
31002013	大工业1-10千伏（小水电电价）	大工业用电	10千伏
31002032	大工业蓄冷电价(1-10千伏)（弃用）	大工业用电	1-10千伏
31002085	大工业1-10千伏（电动汽车）	大工业用电	1-10千伏
34002001	一般工商业220KV	普通工业	220千伏及以上
`
let 电价信息 = {}

电价代码.split("\n").filter(e => e.length).map(e => e.split("\t")).forEach(e => {
    电价信息[e[0]] = { 电价: e[1], 性质: e[2], 电压: e[3] }
})

let 行业分类 = ``



const 表箱信息 = {
    单相: {
        name: "单相表箱",
        sealingStampSlot: 1,
        data: {
            "wzplbm": "010039102223",//单相
            "bxlxdm": "1041001"
        }

    }
    ,
    三相:
    {
        name: "三相表箱",
        sealingStampSlot: 1,
        data: {
            "wzplbm": "010039102511",//三相
            "bxlxdm": "1041002"
        }
    },
}


const 电表类型 = {
    82: {
        name: "单相60A",
        sealingStampSlot: 1,
        data: {
            BDDLDM: "82",//单相60A
            XXLBDM: "01",//相线类别：单相
            EDDYDM: "1",//额定电压：220V
            ZQDDJDM: "47",//准确度等级：A
        },
        withbox: 表箱信息.单相
    },
    83: {
        name: "单相80A",
        sealingStampSlot: 1,
        data: {
            BDDLDM: "83",//单相80A
            XXLBDM: "01",//相线类别：单相
            EDDYDM: "1",//额定电压：220V
            ZQDDJDM: "47"//准确度等级：A
        },
        withbox: 表箱信息.单相
    },
    84: {
        name: "三相直入",
        sealingStampSlot: 2,
        data: {
            BDDLDM: "84",//三相直入
            XXLBDM: "03",//相线类别：三相四线
            EDDYDM: "2",//额定电压：3×220/380V
            ZQDDJDM: "51"//准确度等级：B/2.0
        },
        withbox: 表箱信息.三相
    },
    79: {
        name: "三相互感",
        sealingStampSlot: 2,
        data: {
            BDDLDM: "79",//三相互感
            XXLBDM: "03",//相线类别：三相四线
            EDDYDM: "2",//额定电压：3×220/380V
            ZQDDJDM: "51"//准确度等级：B/2.0
        },
        withbox: 表箱信息.三相
    },
    加单相表封: {

    },
    加三相表封: {

    }
}

const 标定电流类型={
    "10": "3(6)A",
    "11": "3(10)A",
    "12": "5A",
    "13": "5(6)A",
    "14": "5(10)A",
    "15": "5(15)A",
    "16": "5(20)A",
    "17": "5(30)A",
    "18": "5(40)A",
    "19": "10A",
    "20": "10(20)A",
    "21": "10(40)A",
    "22": "10(60)A",
    "23": "15A",
    "24": "15(30)A",
    "25": "20A",
    "26": "20(40)A",
    "27": "20(80)A",
    "28": "25A",
    "29": "25(50)A",
    "30": "30A",
    "31": "30(60)A",
    "32": "30(100)A",
    "33": "40A",
    "34": "50A",
    "35": "80A",
    "36": "90A",
    "37": "0.3(1.2)A",
    "38": "1A",
    "39": "2(10)A",
    "40": "1(2)A",
    "41": "1(5)A",
    "42": "1.5(5)A",
    "43": "1.5(10)A",
    "44": "1.5(30)A",
    "45": "2(3)A",
    "46": "2(4)A",
    "47": "2(6)A",
    "48": "2.5(6)A",
    "49": "2.5(15)A",
    "50": "2.5(60)A",
    "51": "3(20)A",
    "52": "3(30)A",
    "53": "5(60)A",
    "54": "5(100)A",
    "55": "10(30)A",
    "56": "10(80)A",
    "57": "10(100)A",
    "58": "15(20)A",
    "59": "15(60)A",
    "60": "15(90)A",
    "62": "40(60)A",
    "63": "40(80)A",
    "65": "5(150)A",
    "66": "1(4)A",
    "67": "3(5)A",
    "68": "1.5(9)A",
    "69": "1.5(15)A",
    "70": "2.5(20)A",
    "71": "3(2)A",
    "72": "20(100)A",
    "73": "5(80)A",
    "75": "10(400)A",
    "76": "0.1-0.5(60)A",
    "77": "0.1-0.5(80)A",
    "78": "0.1-0.5(100)A",
    "79": "0.01-0.05(10)A",
    "80": "0.003-0.015(1.2)A",
    "81": "125A",
    "82": "0.25-0.5(60)A",
    "83": "0.25-0.5(80)A",
    "84": "0.2-0.5(80)A",
    "88": "630A",
    "89": "800A",
    "90": "100(800)A",
    "91": "400A",
    "92": "250A",
    "01": "1(6)A",
    "02": "1(10)A",
    "03": "1.5A",
    "04": "1.5(6)A",
    "05": "2A",
    "06": "2.5A",
    "07": "2.5(5)A",
    "08": "2.5(10)A",
    "09": "3A"
}

const 相线类别类型={
    "01": "单相",
    "02": "三相三线",
    "03": "三相四线"
}

const 电压类型={
    "1": "220V",
    "2": "3×220/380V",
    "3": "3×57.7/100V",
    "4": "3×380V",
    "5": "3×100V",
    "6": "3×220V",
    "7": "220/380V",
    "8": "400V",
    "99": "380V",
}
const 准确度类型={
    "12": "0.3",
    "13": "0.5",
    "14": "1",
    "15": "2",
    "16": "3",
    "17": "0.2S",
    "18": "0.2S/0.5S",
    "19": "0.2S/0.5S/5P",
    "20": "0.5/2.0",
    "21": "0.5S",
    "22": "0.5S/1.0",
    "23": "0.5S/2.0",
    "24": "1.0S/1.0",
    "25": "1.0S/2.0",
    "26": "0.2/10p",
    "27": "0.5/10p",
    "28": "0.2S/0.5/10P/10P",
    "29": "0.001S",
    "30": "0.002S",
    "31": "0.005S",
    "32": "0.01S",
    "33": "0.02S",
    "34": "0.05S",
    "35": "0.1S",
    "36": "1.0/2.0",
    "37": "1.0S",
    "38": "0.2S/1.0",
    "39": "0.2S/2.0",
    "40": "0.2/0.5/3P",
    "41": "0.2S/0.2S",
    "42": "0.1ppm",
    "43": "0.2ppm",
    "44": "A(有功)",
    "45": "B(有功)",
    "46": "C(有功)",
    "47": "A",
    "48": "A/2.0",
    "49": "B",
    "50": "B/1.0",
    "51": "B/2.0",
    "52": "C",
    "53": "C/1.0S",
    "54": "C/2.0",
    "55": "D",
    "56": "D/0.5S",
    "57": "D/2.0",
    "71": "2×10-7",
    "72": "5×10-9",
    "73": "1×10-7",
    "74": "1×10-8",
    "75": "2×10-8",
    "76": "3×10-7",
    "77": "3×10-8",
    "78": "5×10-8",
    "79": "6×10-8",
    "80": "7×10-8",
    "81": "9×10-8",
    "82": "5",
    "83": "8×10-9",
    "84": "4×10-9",
    "85": "7×10-9",
    "09": "0.2",
    "08": "0.1",
    "07": "0.05",
    "06": "0.03",
    "05": "0.02",
    "04": "0.01",
    "03": "0.005",
    "02": "0.002",
    "01": "0.001"
}

const 变更标识代码 =
{
    "00": "原始记录",
    "10": "新装",
    "15": "拆除",
    "20": "更换前",
    "25": "更换后",
    "30": "抄表前",
    "35": "抄表后",
    "40": "暂停",
    "45": "恢复",
    "50": "换抽头前",
    "55": "换抽头后",
    "60": "移入",
    "65": "移出",
    "70": "关系维护前",
    "75": "关系维护后",
    "80": "移动前",
    "85": "移动后",

}


export default {
    电价信息,
    电表类型,
    变更标识代码,
    表箱信息,
    标定电流类型,
    相线类别类型,
    电压类型,
    准确度类型
}

